app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@books = Book.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]

  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。
---
SELECT "users".* FROM "users"

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "f5e0e15db28b6975062f76fb21fae9558ad572e8bf443b7b064b6ead33b5"], ["updated_at", "2020-05-02 08:40:38.971286"], ["id", 2]]

  def correct_user
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]